[
  {
    "id": "ckd",
    "title": "CKD-EPI 2021",
    "usage": [
      "Uses S cr (Serum Creatinine) to calculate eGFR (Estimated Glomerular Filtration Rate) in adults.",
      "S cr represents the level of creatinine in the blood, a waste product filtered by the kidneys.",
      "Supports early detection and monitoring of CKD (Chronic Kidney Disease).",
      "Classifies CKD stages (G1–G5) based on eGFR results.",
      "Accepts S cr values in mg/dL or µmol/L depending on laboratory reports.",
      "Helps guide medication dose adjustment according to kidney function.",
      "Assists in tracking kidney function changes over time.",
      "Supports routine kidney health screening and clinical decision-making."
    ],
    "bedside": [
    ],
    "formula": "eGFRcr = 142 x min(Scr/κ, 1)^α x max(Scr/κ, 1)^-1.200 x 0.9938^Age x 1.012 [if female]"
  },
  {
    "id": "bedside",
    "title": "Bedside Schwartz",
    "usage": [
      "Used to estimate kidney function (eGFR) in pediatric patients.",
      "Requires S cr (Serum Creatinine) value from laboratory results.",
      "Requires height input in cm or inch for calculation.",
      "Based on the Bedside Schwartz formula.",
      "Helps detect and monitor CKD (Chronic Kidney Disease) in children.",
      "Used for pediatric CKD staging and follow-up.",
      "Assists in adjusting medication dosage according to kidney function in children."
    ],
    "formula": "eGFR = (0.413 × Height in cm) / Serum Creatinine in mg/dL"
  },
{
  "id": "general",
  "info": {
    "definition": [
      "eGFR is an estimate of how well your kidneys are filtering blood.",
      " It measures the rate at which your kidneys remove waste and excess fluid, using blood creatinine levels, age, sex, and sometimes race.",
      " Units: milliliters per minute per 1.73 m² of body surface area (mL/min/1.73 m²)."
    ],
    "units": "mL/min/1.73 m²",
    "importance": [
      "Detects kidney disease early.",
      " Monitors progression of chronic kidney disease (CKD).",
      " Guides medication dosing and treatment decisions."
    ],
    "calculation_methods": [
      "\nThere are multiple formulas, including:",
      "\n\nCKD-EPI (2021): \nPreferred method using serum creatinine, age, and sex. \nMore accurate at higher kidney function.",
      "\n\nMDRD: Older method, less accurate in normal or near-normal kidney function.",
      "\n\nBedside Schwartz: Used for children. \nUses height and serum creatinine."
    ],
    "normal_ranges": [
      "\nG1 (>= 90): Normal kidney function\n\n",
      "G2 (60-89): Mildly decreased\n\n",
      "G3a (45-59): Mild to moderate decrease\n\n",
      "G3b (30-44): Moderate to severe decrease\n\n",
      "G4 (15-29): Severe decrease\n\n",
      "G5 (< 15): Kidney failure"
    ],
    "factors_affecting_eGFR": [
      "\nSerum creatinine levels (affected by muscle mass, diet, medications)\n\n",
      "Age (eGFR declines with age)\n\n",
      "Sex (women generally have lower creatinine)\n\n",
      "Race (previous equations included race; new CKD-EPI does not require it)\n\n",
      "Hydration status and lab variability\n\n"
    ],
    "limitations": [
      "\neGFR is an estimate, not a precise measurement\n\n",
      "May be inaccurate in very muscular or frail people, pregnancy, or rapid kidney function changes\n\n",
      "Should always be interpreted alongside clinical context and other lab results"
    ]
  }
}
]
